spec/dummy/app/controllers/named_controller.rb

  def create_post
    validate(:post) do
      [
        [:title, :title_is_allowed_to_have_numbers?, "no numbers"],
        [:body, :body_is_not_too_long?, "too long"]
      ]
    end

    populate(:post) do |input|
      self.model = Post.new
      model.title = input.title
      model.body = input.body
      model.user = input.user || current_user
      model.save!
---
INSERT INTO "posts" ("user_id", "title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["title", "Number 1!"], ["body", ""], ["created_at", "2022-06-08 05:47:22.945733"], ["updated_at", "2022-06-08 05:47:22.945733"]]

  def create_posts
    validate_for_each(:posts) do
      [
        [:title, :title_is_allowed_to_have_numbers?, "no numbers"],
        [:body, :body_is_not_too_long?, "too long"]
      ]
    end

    @models = []
    populate_for_each(:posts) do |input|
      @models << (model = Post.new)
---
INSERT INTO "posts" ("user_id", "title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["title", "A title"], ["body", ""], ["created_at", "2022-06-08 07:01:50.531036"], ["updated_at", "2022-06-08 07:01:50.531036"]]