spec/dummy/app/controllers/user_controller.rb

INSERT INTO "users" ("email", "created_at", "updated_at") VALUES (?, ?, ?)  [["email", "foo@bar.com"], ["created_at", "2022-03-31 10:39:38.753401"], ["updated_at", "2022-03-31 10:39:38.753401"]]
---
  def create
    populate do |input|
      self.model = User.new
      model.email = input.email
      model.save!

INSERT INTO "users" ("email", "created_at", "updated_at") VALUES (?, ?, ?)  [["email", "foo@bar.com"], ["created_at", "2022-03-31 11:51:29.591985"], ["updated_at", "2022-03-31 11:51:29.591985"]]
---
  def validations
    validate do
      [
        [:email, :email_exists?, "required"],
        [:email, :email_is_email?, "invalid" ],
        [:email, :email_doesnt_already_exist?, "exists"]
      ]
    end

    populate do |input|
      self.model = User.new
      model.email = input.email
      model.save!